# Даны целочисленные координаты точки на плоскости. Если точка совпадает с началом координат, то вывести 0.
# Если точка не совпадает с началом координат, но лежит на оси OX или OY, то вывести соответсвенно 1 или 2.
# Если точка не лежит на координатных осях, то вывести 3
x = input("Введите координаты на оси OX:")
y = input("Введите координаты на оси OY:")
while type(x) != int and type(y) != int:
    try:
        x = int(x)
        y = int(y)
    except ValueError:
        print("Ошибка: Введите целое число")
        x = input("Введите координаты на оси OX:")
        y = input("Введите координаты на оси OY:")
if x == 0 and y == 0: # Если 2 точки в начале координат, то усл срабатывает
    print(0)
elif y == 0: # Если одна точка в начале координат
    print(1)
elif x == 0: # Если одна точка в начале координат
    print(2)
else:
    print(3)
