# Ввести двухзначное число. Если сумма  цифр числа четная, то увеличить число на 2, в противном случае уменьшить на 2.
a = input("введите двухзначное число: ")
while type(a) != int:
    try:
        a = int(a)
        if 10 <= a <= 99:
            break
        else:
            print("Ошибка: надо ввести двухзначное число")
    except ValueError:
        print("Ошибка: непрпавильно введено число")
        a = input("введите двухзначное число: ")
num_1 = a // 10
num_2 = a % 10
sum = num_1 + num_2
if sum % 2 == 0:
    sum += 2
    print(sum)
else:
    sum -= 2
    print(sum)
