#Дано трехзначное число. вывести в начале его последнюю цифру(единицы), а затем его среднюю цифру(десятки).try^a = int(input("Введите трехзначное число:"))
a = int(input("Введите трехзначное число: "))
While
try:
    if not (100 <= a <=999):
        print("Ошибка: число должно быть трехзначным")
except ValueError:
    print("Ошибка: нужно ввести целое число, без букв и точек")
last_num = a % 10 #Вычисляется остаток от деления на 10
average_num = (a // 10) % 10 #Делится на цело на 10, что позваляется оставить первые два числа и после найти остаток от деления на 10
print("Последнее число: ", last_num,"Среднее число: ", average_num)